# -*- coding: utf-8 -*-
import time
from inclinometer import Inclinometer

# ==========================================================
# DLL路径
# ==========================================================
DLL_PATH = (r"../../bin/InclinometerSDK.dll")

# ==========================================================
# 创建SDK
# ==========================================================
sensor = Inclinometer(DLL_PATH)

try:
    # ------------------------------------------------------
    # 获取版本
    # ------------------------------------------------------
    print("SDK Version:", sensor.get_version())

    # ------------------------------------------------------
    # 启动
    # ------------------------------------------------------
    sensor.start(port=r"\\.\COM9", baudrate=9600, auto_reconnect=True)
    print("倾角仪启动成功")

    # ------------------------------------------------------
    # 等待串口数据
    # ------------------------------------------------------
    time.sleep(1)

    # ------------------------------------------------------
    # 循环读取
    # ------------------------------------------------------
    while True:
        if not sensor.is_running():
            print("SDK已经停止")
            break

        x, y = (sensor.get_angle())

        print(
            "X = {:8.3f}°, "
            "Y = {:8.3f}°".format(x, y))
        time.sleep(0.1)

except KeyboardInterrupt:
    print("\n用户按下 Ctrl+C")

except Exception as e:
    print("错误:", e)

finally:
    sensor.close()
    print("倾角仪已关闭")